Autodesk.Revit.DB.BuiltInFailures.DirectShapeFailures.CannotCreateDirectShapeOrTypeWarning
Cannot create a DirectShape or DirectShapeType.

Autodesk.Revit.DB.BuiltInFailures.DirectShapeFailures.CannotCreateDirectShapeOrTypeError
Cannot create a DirectShape or DirectShapeType.

Autodesk.Revit.DB.BuiltInFailures.DirectShapeFailures.CannotCreateDirectShapeOrTypeDocumentCorruption
Cannot create a DirectShape or DirectShapeType.

Autodesk.Revit.DB.BuiltInFailures.DirectShapeFailures
Failure definitions related to DirectShapes.